In [1]:
import pandas as pd

In [10]:
data = {
    "id": [5,2,3,4],
    "city": ["Bern", "Blaurib", "Buege", "Bepo"],
    "population": [102424, 34204, 452343, 3424],
    "rank": [11, 41,32,1]}

df = pd.DataFrame(data,
            index = pd.Index(["A", "B", "C", "D"], name = "letter"),
            columns = pd.Index(["id", "city", "population", "rank"], name = "Attributes"))

df

Attributes  id     city  population  rank
letter
A            5     Bern      102424    11
B            2  Blaurib       34204    41
C            3    Buege      452343    32
D            4     Bepo        3424     1

letter = name der Index Spalte 

Attributes = Name der Spalten

In [18]:
# Index Spalten Name
df_stack_series = df.stack("Attributes")

print(df_stack_series)
print(type(df_stack_series))

letter  Attributes
A       id                  5
        city             Bern
        population     102424
        rank               11
B       id                  2
        city          Blaurib
        population      34204
        rank               41
C       id                  3
        city            Buege
        population     452343
        rank               32
D       id                  4
        city             Bepo
        population       3424
        rank                1
dtype: object
<class 'pandas.core.series.Series'>

In [14]:
df_stack_series.unstack("letter")
# Bei unstack kommt der Index Name von der Spalten

letter           A        B       C     D
Attributes
id               5        2       3     4
city          Bern  Blaurib   Buege  Bepo
population  102424    34204  452343  3424
rank            11       41      32     1

In [21]:
df_stack_series.unstack("Attributes")
# Urspruengliche Spalte Index Name

Attributes id     city population rank
letter
A           5     Bern     102424   11
B           2  Blaurib      34204   41
C           3    Buege     452343   32
D           4     Bepo       3424    1